issues/5.org
#+options: toc:nil
#+latex_header: \usepackage[margin=1in]{geometry}

* Issue 5 (Local nickname shadowing package's own name)
** Description
   It is not clear whether it is valid to have a /local nickname/ in a package
   shadowing its own name or nickname.
** Examples
   #+BEGIN_SRC common-lisp
     (defpackage #:foo
       (:use)
       (:nicknames #:bar)
       (:local-nicknames (#:foo #:cl)
                         (#:bar #:cl)))
     ; => continuable error  (sbcl, ccl, abcl)
     ; => error  (lispworks)
     ; => ok  (ecl, acl, clasp)
   #+END_SRC
** Current behavior
   sbcl, ccl, abcl and lispwork signal an error.
** Proposal ALLOW
   It should be allowed to use package's own name or global nickname, but a
   style-warning can be signalled.
