export/issues/5.tex
% Created 2024-07-05 Fri 13:31
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1in]{geometry}
\author{Gleefre}
\date{\today}
\title{PLN CDR draft: Issue 5}
\hypersetup{
 pdfauthor={Gleefre},
 pdftitle={PLN CDR draft: Issue 5},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.5.5)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Issue 5 (Local nickname shadowing package's own name)}
\label{sec:org04e4145}
\subsection{Description}
\label{sec:org2957db6}
It is not clear whether it is valid to have a \emph{local nickname} in a package
shadowing its own name or nickname.
\subsection{Examples}
\label{sec:org25e6697}
\begin{verbatim}
(defpackage #:foo
  (:use)
  (:nicknames #:bar)
  (:local-nicknames (#:foo #:cl)
                    (#:bar #:cl)))
; => continuable error  (sbcl, ccl, abcl)
; => error  (lispworks)
; => ok  (ecl, acl, clasp)
\end{verbatim}
\subsection{Current behavior}
\label{sec:org2c2ccd1}
sbcl, ccl, abcl and lispwork signal an error.
\subsection{Proposal ALLOW}
\label{sec:orgd0b7038}
It should be allowed to use package's own name or global nickname, but a
style-warning can be signalled.
\end{document}